src/cf/Catalogs/ор_МДЛПУпаковкиМаркируемыхТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ор_МДЛПУпаковкиМаркируемыхТоваров</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерУпаковки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерУпаковкиМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючУпаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.КатегорииНоменклатуры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Артикул характеристики</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМGTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатурыПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_ДатаИзготовления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_Декларант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_МаркируемыйТовар</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_ОрганВыдавшийСертификат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_ОрганЗарегистрировавшийДекларацию</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ор_Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СерияПроизводителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СертификатСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СрокДействияСертификата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СтранаПроисхождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_Фальсификат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_НаименованиеПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗанятости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗанятости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетРасчетовСПерсоналом</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетРасчетовСПодотчетниками</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетРасчетовПоПерерасходу</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтрихКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МагнитныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийПроцентСевернойНадбавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННВведенКорректно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/РаботаСоШтрихкодамиУНФ/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// См. РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьПрефиксыШтрихкодовНоменклатуры.
Процедура ЗаполнитьПрефиксыШтрихкодовНоменклатуры(СтруктураПрефиксов) Экспорт
	
	Префикс = НСтр("ru='2'");
	
	СтруктураПрефиксов = Новый ТаблицаЗначений;
	СтруктураПрефиксов.Колонки.Добавить("Ключ");
	СтруктураПрефиксов.Колонки.Добавить("Значение");
	
	ПрефиксыВесовыхШтрихкодов = РегистрыСведений.ШтрихкодыНоменклатуры.ПрефиксыВесовыхШтрихкодов();
	
	Для Каждого ПрефиксВесовогоШтрихкода Из ПрефиксыВесовыхШтрихкодов Цикл
		Доб1 = СтруктураПрефиксов.Добавить();
		Доб1.Ключ = "НоменклатураВесовой";
		Доб1.Значение = Префикс + ПрефиксВесовогоШтрихкода;
	КонецЦикла;
	
	ПрефиксыШтучныхШтрихкодов = РегистрыСведений.ШтрихкодыНоменклатуры.ПрефиксыШтучныхШтрихкодов();
	
	Для Каждого ПрефиксШтучногоШтрихкода Из ПрефиксыШтучныхШтрихкодов Цикл
		Доб1 = СтруктураПрефиксов.Добавить();
		Доб1.Ключ = "НоменклатураФасованный";
		Доб1.Значение = Префикс + ПрефиксШтучногоШтрихкода;
	КонецЦикла;
	
	Доб1 = СтруктураПрефиксов.Добавить();
	Доб1.Ключ = "НоменклатураШтучный";
	Доб1.Значение=  Префикс + Константы.ПрефиксВнутреннегоШтрихкодаШтучногоТовара.Получить();
	
	Если ПолучитьФункциональнуюОпцию("ВестиУчетСредствИндивидуальнойЗащиты") Тогда
		Доб1 = СтруктураПрефиксов.Добавить();
		Доб1.Ключ = "НоменклатураСИЗ";
		Доб1.Значение= НСтр("ru='24'");
	КонецЕсли;
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ДобавитьТекстЗапросаШтрихкоды.
Процедура ДобавитьТекстЗапросаШтрихкоды(ФильтрПоискаПоШтрихкоду, МассивЗапросов) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Штрихкоды.Штрихкод КАК Штрихкод,
	|	Штрихкоды.Номенклатура КАК Владелец,
	|	Штрихкоды.Характеристика КАК Характеристика,
	|	Штрихкоды.ЕдиницаИзмерения КАК Упаковка,
	|	NULL КАК Серия,
	|	Штрихкоды.Партия КАК Партия,
	|	1 КАК Количество,
	|	ЗНАЧЕНИЕ(Перечисление.ШаблоныШтрихкодов.НоменклатураШтучный) КАК ШаблонШтрихкода
	|ПОМЕСТИТЬ ШтрихкодыВсе
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды";
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатуры") Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "NULL КАК Серия", "СерииНоменклатуры.Ссылка КАК Серия");
		ТекстЗапроса = ТекстЗапроса + "
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
			|		ПО Штрихкоды.Номенклатура = СерииНоменклатуры.Владелец
			|			И (Штрихкоды.Номенклатура.ИспользоватьСерииНоменклатуры)
			|			И Штрихкоды.Штрихкод = СерииНоменклатуры.Наименование
			|			И НЕ СерииНоменклатуры.ПометкаУдаления
			|			И НЕ СерииНоменклатуры.Продан";
		
		Если ФильтрПоискаПоШтрихкоду.Свойство("МассивУжеДобавленныхСерий") Тогда
			ТекстЗапроса = ТекстЗапроса + " И НЕ СерииНоменклатуры.Ссылка В (&МассивУжеДобавленныхСерий)";
		КонецЕсли;
		
	КонецЕсли;
	
	Если ФильтрПоискаПоШтрихкоду.Количество() > 0 Тогда
		
		Если ФильтрПоискаПоШтрихкоду.Свойство("ЗаданнаяТаблицаНоменклатуры") Тогда
			
			ТекстЗапроса =
				"ВЫБРАТЬ
				|	Выразить(&Штрихкод КАК Строка(200)) КАК Штрихкод,
				|	Штрихкоды.Номенклатура КАК Владелец,
				|	Штрихкоды.Характеристика КАК Характеристика,
				|	Штрихкоды.Упаковка КАК Упаковка
				|ПОМЕСТИТЬ ТаблицаНоменклатуры
				|ИЗ
				|	&ЗаданнаяТаблицаНоменклатуры КАК Штрихкоды
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	Штрихкоды.Штрихкод КАК Штрихкод,
				|	Штрихкоды.Владелец КАК Владелец,
				|	Штрихкоды.Характеристика КАК Характеристика,
				|	Штрихкоды.Упаковка КАК Упаковка,
				// ор ++
				// Нам необходимо чтобы тут были пустые ссылки а не NULL.
				|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
				|	Значение(Справочник.ПартииНоменклатуры.ПустаяСсылка) КАК Партия,
				// ор --
				|	1 КАК Количество,
				|	НЕОПРЕДЕЛЕНО КАК ШаблонШтрихкода
				|ПОМЕСТИТЬ ШтрихкодыВсе
				|ИЗ
				|	ТаблицаНоменклатуры КАК Штрихкоды";
			
				Если ФильтрПоискаПоШтрихкоду.Свойство("ЭтоКодМаркировки") Тогда
					ТекстЗапроса = ТекстЗапроса + "
						|ГДЕ НЕ ИСТИНА В
						|(ВЫБРАТЬ ПЕРВЫЕ 1
						|	ИСТИНА КАК НайденШтрихкодМарки
						|ИЗ
						|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
						|ГДЕ
						|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода = &ШтрихкодМарки
						|	И НЕ ШтрихкодыУпаковокТоваров.Номенклатура = Значение(Справочник.Номенклатура.ПустаяСсылка))";
				КонецЕсли;
				
				МассивЗапросов.Добавить(ТекстЗапроса);
				Возврат;
				
		КонецЕсли;
		
		Если Не ФильтрПоискаПоШтрихкоду.Свойство("Номенклатура") Тогда
			ТекстЗапроса = ТекстЗапроса + " ГДЕ ЛОЖЬ";
			МассивЗапросов.Добавить(ТекстЗапроса);
			Возврат;
		КонецЕсли;
		
		// ор ++
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"Штрихкоды.Штрихкод КАК Штрихкод,",
			"ВЫБОР КОГДА Штрихкоды.Штрихкод = &GTINМДЛП Тогда &Штрихкод ИНАЧЕ Штрихкоды.Штрихкод КОНЕЦ КАК Штрихкод,");
		// ор --
		
		ТекстЗапроса = ТекстЗапроса + "
			// ор ++
			|ГДЕ (Штрихкоды.Штрихкод = &Штрихкод ИЛИ Штрихкоды.Штрихкод = &GTINМДЛП)
			// ор --
			|	И НЕ Штрихкоды.Номенклатура = Значение(Справочник.Номенклатура.ПустаяСсылка)";
		
		ТекстЗапроса = ТекстЗапроса + "
			|	И НЕ (Штрихкоды.Номенклатура, Штрихкоды.Характеристика) В
			|	(ВЫБРАТЬ
			|	НастройкиЧастичногоВыбытияПродукцииИС.НоменклатураЧастичногоВыбытия КАК Номенклатура,
			|	НастройкиЧастичногоВыбытияПродукцииИС.ХарактеристикаЧастичногоВыбытия КАК Характеристика
			|ИЗ
			|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиЧастичногоВыбытияПродукцииИС КАК НастройкиЧастичногоВыбытияПродукцииИС
			|		ПО (ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод)
			|			И ШтрихкодыНоменклатуры.Номенклатура = НастройкиЧастичногоВыбытияПродукцииИС.Номенклатура
			|			И ШтрихкодыНоменклатуры.Характеристика = НастройкиЧастичногоВыбытияПродукцииИС.Характеристика
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
			|		ПО ОписаниеНоменклатурыИС.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура
			|			И ЕСТЬNULL(ОписаниеНоменклатурыИС.КлючВидовПродукции.ВидПродукцииГИСМТ, ЗНАЧЕНИЕ(Справочник.ВидыПродукцииИС.ПустаяСсылка))
			|			<> ЗНАЧЕНИЕ(Справочник.ВидыПродукцииИС.ПустаяСсылка))";
		
		Если ФильтрПоискаПоШтрихкоду.Свойство("ЭтоКодМаркировки") Тогда
			ТекстЗапроса = ТекстЗапроса + "
				| И НЕ ИСТИНА В
				|(ВЫБРАТЬ ПЕРВЫЕ 1
				|	ИСТИНА КАК НайденШтрихкодМарки
				|ИЗ
				|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
				|ГДЕ
				|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода = &ШтрихкодМарки
				|	И НЕ ШтрихкодыУпаковокТоваров.Номенклатура = Значение(Справочник.Номенклатура.ПустаяСсылка))";
			// +ор интеграция МДЛП
			ТекстЗапроса = ТекстЗапроса + "
				| И НЕ Штрихкоды.Номенклатура В
				|(ВЫБРАТЬ
				|	ор_МДЛПУпаковкиМаркируемыхТоваров.Номенклатура КАК Номенклатура
				|ИЗ
				|	Справочник.ор_МДЛПУпаковкиМаркируемыхТоваров КАК ор_МДЛПУпаковкиМаркируемыхТоваров
				|ГДЕ
				|	ор_МДЛПУпаковкиМаркируемыхТоваров.НомерУпаковки = &НомерУпаковкиSGTIN
				|	И ор_МДЛПУпаковкиМаркируемыхТоваров.КлючУпаковки = &КлючУпаковкиSGTIN)";
			// -ор интеграция МДЛП
		КонецЕсли;
		
	КонецЕсли;
	
	МассивЗапросов.Добавить(ТекстЗапроса);
	
	Если ФильтрПоискаПоШтрихкоду.Количество() > 0 Тогда
		
		Если Не ФильтрПоискаПоШтрихкоду.Свойство("Номенклатура") Тогда
			Возврат;
		КонецЕсли;
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Штрихкоды.Штрихкод,
		|	НастройкиЧастичногоВыбытияПродукцииИС.НоменклатураЧастичногоВыбытия,
		|	НастройкиЧастичногоВыбытияПродукцииИС.ХарактеристикаЧастичногоВыбытия,
		|	Штрихкоды.ЕдиницаИзмерения,
		|	NULL,
		|	Штрихкоды.Партия,
		|	1,
		|	ЗНАЧЕНИЕ(Перечисление.ШаблоныШтрихкодов.НоменклатураШтучный)
		|ИЗ
		|	(ВЫБРАТЬ
		|		ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
		|		ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
		|		ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
		|		ШтрихкодыНоменклатуры.Партия КАК Партия,
		|		ШтрихкодыНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|	ИЗ
		|		РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|	ГДЕ
		|		ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод
		|		И НЕ ШтрихкодыНоменклатуры.Номенклатура = Значение(Справочник.Номенклатура.ПустаяСсылка)) КАК Штрихкоды
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиЧастичногоВыбытияПродукцииИС КАК НастройкиЧастичногоВыбытияПродукцииИС
		|		ПО Штрихкоды.Номенклатура = НастройкиЧастичногоВыбытияПродукцииИС.Номенклатура
		|			И Штрихкоды.Характеристика = НастройкиЧастичногоВыбытияПродукцииИС.Характеристика
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|		ПО (НастройкиЧастичногоВыбытияПродукцииИС.НоменклатураЧастичногоВыбытия = СпрНоменклатура.Ссылка)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
		|		ПО ОписаниеНоменклатурыИС.Номенклатура = НастройкиЧастичногоВыбытияПродукцииИС.НоменклатураЧастичногоВыбытия
		|			И ЕСТЬNULL(ОписаниеНоменклатурыИС.КлючВидовПродукции.ВидПродукцииГИСМТ, ЗНАЧЕНИЕ(Справочник.ВидыПродукцииИС.ПустаяСсылка))
		|			= ЗНАЧЕНИЕ(Справочник.ВидыПродукцииИС.ПустаяСсылка)
		|			И ЕСТЬNULL(ОписаниеНоменклатурыИС.КлючВидовПродукции.ВидПродукцииЕГАИС, ЗНАЧЕНИЕ(Справочник.ВидыПродукцииИС.ПустаяСсылка))
		|			<> ЗНАЧЕНИЕ(Справочник.ВидыПродукцииИС.ПустаяСсылка)
		|ГДЕ
		|	НЕ НастройкиЧастичногоВыбытияПродукцииИС.Номенклатура ЕСТЬ NULL";
		
		Если ФильтрПоискаПоШтрихкоду.Свойство("ЭтоКодМаркировки") Тогда
			ТекстЗапроса = ТекстЗапроса + "
				| И НЕ ИСТИНА В
				|(ВЫБРАТЬ ПЕРВЫЕ 1
				|	ИСТИНА КАК НайденШтрихкодМарки
				|ИЗ
				|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
				|ГДЕ
				|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода = &ШтрихкодМарки
				|	И НЕ ШтрихкодыУпаковокТоваров.Номенклатура = Значение(Справочник.Номенклатура.ПустаяСсылка))";
		КонецЕсли;
		
		МассивЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ДобавитьТекстЗапросаСерии.
Процедура ДобавитьТекстЗапросаСерии(ФильтрПоискаПоШтрихкоду, МассивЗапросов) Экспорт
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатуры")
		И ФильтрПоискаПоШтрихкоду.Свойство("СерииНоменклатуры") Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	СерииНоменклатуры.Наименование,
		|	СерииНоменклатуры.Ссылка,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	1,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
		|ГДЕ
		|	СерииНоменклатуры.Владелец = &НоменклатураДляПоискаСерии
		|	И СерииНоменклатуры.Наименование = &Штрихкод
		|	И НЕ СерииНоменклатуры.ПометкаУдаления
		|	И НЕ СерииНоменклатуры.Продан";
		
		Если ФильтрПоискаПоШтрихкоду.Свойство("МассивУжеДобавленныхСерий") Тогда
			ТекстЗапроса = ТекстЗапроса + " И НЕ СерииНоменклатуры.Ссылка В (&МассивУжеДобавленныхСерий)";
		КонецЕсли;
		
		Если ФильтрПоискаПоШтрихкоду.Свойство("ЭтоВозвратПродажи") Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И НЕ СерииНоменклатуры.Продан", "И СерииНоменклатуры.Продан");
		КонецЕсли;
		
		МассивЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПартии")
		И ФильтрПоискаПоШтрихкоду.Свойство("СерииНоменклатуры") Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ПартииНоменклатуры.Наименование,
		|	ПартииНоменклатуры.Ссылка,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	1,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	Справочник.ПартииНоменклатуры КАК ПартииНоменклатуры
		|ГДЕ
		|	ПартииНоменклатуры.Владелец = &НоменклатураДляПоискаСерии
		|	И ПартииНоменклатуры.Наименование = &Штрихкод
		|	И НЕ ПартииНоменклатуры.ПометкаУдаления
		|	И НЕ ПартииНоменклатуры.Недействителен";
		
		МассивЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ДобавитьТекстЗапросаКодыSKU.
Процедура ДобавитьТекстЗапросаКодыSKU(ФильтрПоискаПоШтрихкоду, МассивЗапросов) Экспорт
	
	Если НЕ ФильтрПоискаПоШтрихкоду.Свойство("ШаблонКодТовараSKU") Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	КодыТоваровSKU.SKU,
	|	КодыТоваровSKU.Номенклатура,
	|	КодыТоваровSKU.Характеристика,
	|	КодыТоваровSKU.ЕдиницаИзмерения,
	|	NULL,
	|	КодыТоваровSKU.Партия,
	|	&КоличествоТовара,
	|	ЗНАЧЕНИЕ(Перечисление.ШаблоныШтрихкодов.НоменклатураВесовой)
	|ИЗ
	|	РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKU
	|ГДЕ
	|	КодыТоваровSKU.SKU = &КодТовара
	|	И НЕ КодыТоваровSKU.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)";
	
	МассивЗапросов.Добавить(ТекстЗапроса);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&КодТовара,
	|	Штрихкоды.Номенклатура,
	|	Штрихкоды.Характеристика,
	|	Штрихкоды.ЕдиницаИзмерения,
	|	NULL,
	|	Штрихкоды.Партия,
	|	&КоличествоТовара,
	|	ЗНАЧЕНИЕ(Перечисление.ШаблоныШтрихкодов.НоменклатураВесовой)
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Штрихкод = &ШтрихкодСНулевымВесом
	|	И &КоличествоТовара > 0
	|	И НЕ Штрихкоды.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)";
	
	МассивЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ДобавитьТекстЗапросаШтрихкодыУпаковокТоваров.
Процедура ДобавитьТекстЗапросаШтрихкодыУпаковокТоваров(ФильтрПоискаПоШтрихкоду, МассивЗапросов) Экспорт
	
	СУсловиемПоиска = ФильтрПоискаПоШтрихкоду.Количество() > 0;
	
	Если СУсловиемПоиска И НЕ ФильтрПоискаПоШтрихкоду.Свойство("Номенклатура") Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьЗапросПолногоВыбытия = Истина;
	ДобавитьЗапросЧастичногоВыбытия = Истина;
	Если ФильтрПоискаПоШтрихкоду.Свойство("ЭтоМаркаКТекущейСтроке") Тогда
		Если ФильтрПоискаПоШтрихкоду.Свойство("ЭтоТекущаяСтрокаЧастичногоВыбытия") Тогда
			ДобавитьЗапросПолногоВыбытия = Ложь;
		Иначе
			ДобавитьЗапросЧастичногоВыбытия = Ложь;
		КонецЕсли;
	Иначе
		Если ФильтрПоискаПоШтрихкоду.Свойство("РанееМаркаВыбывалаЧастично") Тогда
			ДобавитьЗапросПолногоВыбытия = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ДобавитьЗапросПолногоВыбытия Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Штрихкоды.ЗначениеШтрихкода,
		|	Штрихкоды.Ссылка,
		|	Штрихкоды.Характеристика,
		|	ВЫБОР
		|		КОГДА ОписаниеНоменклатурыИС.ПотребительскаяУпаковка ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|				КОГДА Штрихкоды.Упаковка ССЫЛКА Справочник.ЕдиницыИзмерения
		|					ТОГДА Штрихкоды.Упаковка
		|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
		|			КОНЕЦ
		|		ИНАЧЕ ОписаниеНоменклатурыИС.ПотребительскаяУпаковка
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Штрихкоды.Серия ССЫЛКА Справочник.СерииНоменклатуры
		|			ТОГДА Штрихкоды.Серия
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Штрихкоды.Серия ССЫЛКА Справочник.ПартииНоменклатуры
		|			ТОГДА Штрихкоды.Серия
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ОписаниеНоменклатурыИС.ПотребительскаяУпаковка ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|				КОГДА Штрихкоды.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МаркированныйТовар)
		|				И НЕ Штрихкоды.Количество = 0
		|					ТОГДА Штрихкоды.Количество
		|				ИНАЧЕ 1
		|			КОНЕЦ
		|		ИНАЧЕ 1
		|	КОНЕЦ,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	Справочник.ШтрихкодыУпаковокТоваров КАК Штрихкоды
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
		|	ПО (Штрихкоды.Номенклатура = ОписаниеНоменклатурыИС.Номенклатура
		|	И ОписаниеНоменклатурыИС.ВариантЧастичногоВыбытия = ЗНАЧЕНИЕ(Перечисление.ВариантыУчетаЧастичногоВыбытияИС.ТекущаяНоменклатура))";
		
		Если СУсловиемПоиска Тогда
			ТекстЗапроса = ТекстЗапроса + " ГДЕ Штрихкоды.ЗначениеШтрихкода = &ШтрихкодМарки
				| И НЕ Штрихкоды.Номенклатура = Значение(Справочник.Номенклатура.ПустаяСсылка)";
		КонецЕсли;
		
		МассивЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	Если Не СУсловиемПоиска Тогда
		Возврат;
	КонецЕсли;
	
	Если ДобавитьЗапросЧастичногоВыбытия Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Штрихкоды.ЗначениеШтрихкода,
		|	НастройкиЧастичногоВыбытияПродукцииИС.НоменклатураЧастичногоВыбытия,
		|	НастройкиЧастичногоВыбытияПродукцииИС.ХарактеристикаЧастичногоВыбытия,
		|	Штрихкоды.Упаковка,
		|	Штрихкоды.Серия,
		|	Штрихкоды.Партия,
		|	Штрихкоды.Количество,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	(ВЫБРАТЬ
		|		ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
		|		ШтрихкодыУпаковокТоваров.Номенклатура КАК Номенклатура,
		|		ШтрихкодыУпаковокТоваров.Характеристика КАК Характеристика,
		|		ВЫБОР
		|			КОГДА ШтрихкодыУпаковокТоваров.Упаковка ССЫЛКА Справочник.ЕдиницыИзмерения
		|				ТОГДА ШтрихкодыУпаковокТоваров.Упаковка
		|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
		|		КОНЕЦ КАК Упаковка,
		|		ВЫБОР
		|			КОГДА ШтрихкодыУпаковокТоваров.Серия ССЫЛКА Справочник.СерииНоменклатуры
		|				ТОГДА ШтрихкодыУпаковокТоваров.Серия
		|		КОНЕЦ КАК Серия,
		|		ВЫБОР
		|			КОГДА ШтрихкодыУпаковокТоваров.Серия ССЫЛКА Справочник.ПартииНоменклатуры
		|				ТОГДА ШтрихкодыУпаковокТоваров.Серия
		|		КОНЕЦ КАК Партия,
		|		ВЫБОР
		|			КОГДА ШтрихкодыУпаковокТоваров.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МаркированныйТовар)
		|					И НЕ ШтрихкодыУпаковокТоваров.Количество = 0
		|				ТОГДА ШтрихкодыУпаковокТоваров.Количество
		|			ИНАЧЕ 1
		|		КОНЕЦ КАК Количество
		|	ИЗ
		|		Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
		|	ГДЕ
		|		ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода = &ШтрихкодМарки
		|		И НЕ ШтрихкодыУпаковокТоваров.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Штрихкоды
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиЧастичногоВыбытияПродукцииИС КАК НастройкиЧастичногоВыбытияПродукцииИС
		|		ПО Штрихкоды.Номенклатура = НастройкиЧастичногоВыбытияПродукцииИС.Номенклатура
		|			И Штрихкоды.Характеристика = НастройкиЧастичногоВыбытияПродукцииИС.Характеристика
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
		|		ПО (НастройкиЧастичногоВыбытияПродукцииИС.НоменклатураЧастичногоВыбытия = НоменклатураСпр.Ссылка)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
		|		ПО ОписаниеНоменклатурыИС.Номенклатура = НастройкиЧастичногоВыбытияПродукцииИС.НоменклатураЧастичногоВыбытия
		|			И ЕСТЬNULL(ОписаниеНоменклатурыИС.КлючВидовПродукции.ВидПродукцииГИСМТ, ЗНАЧЕНИЕ(Справочник.ВидыПродукцииИС.ПустаяСсылка))
		|			= ЗНАЧЕНИЕ(Справочник.ВидыПродукцииИС.ПустаяСсылка)
		|			И ЕСТЬNULL(ОписаниеНоменклатурыИС.КлючВидовПродукции.ВидПродукцииЕГАИС, ЗНАЧЕНИЕ(Справочник.ВидыПродукцииИС.ПустаяСсылка))
		|			<> ЗНАЧЕНИЕ(Справочник.ВидыПродукцииИС.ПустаяСсылка)
		|ГДЕ
		|	НЕ НастройкиЧастичногоВыбытияПродукцииИС.НоменклатураЧастичногоВыбытия ЕСТЬ NULL";
		
		МассивЗапросов.Добавить(ТекстЗапроса);
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Штрихкоды.ЗначениеШтрихкода,
		|	Штрихкоды.Ссылка,
		|	Штрихкоды.Характеристика,
		|	ВЫБОР
		|		КОГДА Штрихкоды.Упаковка ССЫЛКА Справочник.ЕдиницыИзмерения
		|			ТОГДА Штрихкоды.Упаковка
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Штрихкоды.Серия ССЫЛКА Справочник.СерииНоменклатуры
		|			ТОГДА Штрихкоды.Серия
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Штрихкоды.Серия ССЫЛКА Справочник.ПартииНоменклатуры
		|			ТОГДА Штрихкоды.Серия
		|	КОНЕЦ,
		|	1,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	Справочник.ШтрихкодыУпаковокТоваров КАК Штрихкоды
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
		|		ПО (Штрихкоды.Номенклатура = ОписаниеНоменклатурыИС.Номенклатура)
		|			И (ОписаниеНоменклатурыИС.ВариантЧастичногоВыбытия = ЗНАЧЕНИЕ(Перечисление.ВариантыУчетаЧастичногоВыбытияИС.ТекущаяНоменклатура))
		|ГДЕ
		|	Штрихкоды.ЗначениеШтрихкода = &ШтрихкодМарки
		|	И НЕ Штрихкоды.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|	И НЕ ОписаниеНоменклатурыИС.Номенклатура ЕСТЬ NULL";
		
		МассивЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ДобавитьТекстЗапросаНоменклатурнойКлассификации.
Процедура ДобавитьТекстЗапросаНоменклатурнойКлассификации(ФильтрПоискаПоШтрихкоду, МассивЗапросов) Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("ВестиУчетСредствИндивидуальнойЗащиты") Тогда
		Возврат;
	КонецЕсли;
	
	СУсловиемПоиска = ФильтрПоискаПоШтрихкоду.Количество() > 0;
	
	Если СУсловиемПоиска И НЕ ФильтрПоискаПоШтрихкоду.Свойство("Номенклатура") Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Номенклатура.КодМедицинскогоИзделия,
	|	Номенклатура.Ссылка,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|	NULL,
	|	NULL,
	|	NULL,
	|	1,
	|	ЗНАЧЕНИЕ(Перечисление.ШаблоныШтрихкодов.НоменклатураСИЗ)
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура";
	
	ТекстЗапроса = ТекстЗапроса + ?(СУсловиемПоиска,
		" ГДЕ Номенклатура.КодМедицинскогоИзделия = &Штрихкод",
		" ГДЕ НЕ Номенклатура.КодМедицинскогоИзделия = """" ");
	
	МассивЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ДобавитьТекстЗапросаШаблоныРегистрацииКарт.
Процедура ДобавитьТекстЗапросаШаблоныРегистрацииКарт(ФильтрПоискаПоШтрихкоду, МассивЗапросов) Экспорт
	
	Возврат ;
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ДобавитьТекстЗапросаПоТелефону.
Процедура ДобавитьТекстЗапросаПоТелефону(ФильтрПоискаПоШтрихкоду, МассивЗапросов) Экспорт
	
	Если НЕ ФильтрПоискаПоШтрихкоду.Свойство("ИнформационныеКарты")
		И НЕ ФильтрПоискаПоШтрихкоду.Свойство("ПоследниеЦифрыТелефона") Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&НомерТелефона,
	|	ЕСТЬNULL(ДисконтныеКарты.Ссылка, КонтрагентыКонтактнаяИнформация.Ссылка),
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ЗНАЧЕНИЕ(Перечисление.ШаблоныШтрихкодов.Телефон)
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДисконтныеКарты КАК ДисконтныеКарты
	|		ПО КонтрагентыКонтактнаяИнформация.Ссылка = ДисконтныеКарты.ВладелецКарты
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И КонтрагентыКонтактнаяИнформация.ОбратныйНомерТелефона = &НомерТелефона
	|	И НЕ ДисконтныеКарты.КартаНедействительна";
	
	Если ФильтрПоискаПоШтрихкоду.Свойство("ПоследниеЦифрыТелефона") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ОбратныйНомерТелефона = &НомерТелефона", "ОбратныйНомерТелефона ПОДОБНО &ШтрихкодИнверсия");
	КонецЕсли;
	
	МассивЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ДобавитьТекстЗапросаПоАдресуЭП.
Процедура ДобавитьТекстЗапросаПоАдресуЭП(ФильтрПоискаПоШтрихкоду, МассивЗапросов) Экспорт
	
	Если НЕ ФильтрПоискаПоШтрихкоду.Свойство("ИнформационныеКарты") Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&АдресЭП,
	|	ЕСТЬNULL(ДисконтныеКарты.Ссылка, КонтрагентыКонтактнаяИнформация.Ссылка),
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ЗНАЧЕНИЕ(Перечисление.ШаблоныШтрихкодов.АдресЭП)
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДисконтныеКарты КАК ДисконтныеКарты
	|		ПО КонтрагентыКонтактнаяИнформация.Ссылка = ДисконтныеКарты.ВладелецКарты
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|	И КонтрагентыКонтактнаяИнформация.АдресЭП = &АдресЭП";
	
	МассивЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ДобавитьТекстЗапросаДополнительныеОбъекты.
Процедура ДобавитьТекстЗапросаДополнительныеОбъекты(ФильтрПоискаПоШтрихкоду, МассивЗапросов) Экспорт
	
	СУсловиемПоиска = ФильтрПоискаПоШтрихкоду.Количество() > 0;
	
	Если НЕ СУсловиемПоиска ИЛИ ФильтрПоискаПоШтрихкоду.Свойство("ФизическиеЛица") Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Сотрудники.ШтрихКод,
		|	Сотрудники.Ссылка,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	1,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	НЕ Сотрудники.ЭтоГруппа
		|	И НЕ Сотрудники.ПометкаУдаления
		|	И НЕ Сотрудники.Недействителен
		|	И &Условие";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Условие",
			?(СУсловиемПоиска, "Сотрудники.ШтрихКод = &Штрихкод",
				"НЕ Сотрудники.ШтрихКод = """" "));
			
		Если ФильтрПоискаПоШтрихкоду.Свойство("КассирДляВхода") Тогда
			ТекстЗапроса = ТекстЗапроса +
				"
				|И Сотрудники.Ссылка = &КассирДляВхода";
		КонецЕсли;

		МассивЗапросов.Добавить(ТекстЗапроса);
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Сотрудники.МагнитныйКод,
		|	Сотрудники.Ссылка,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	1,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	НЕ Сотрудники.ЭтоГруппа
		|	И НЕ Сотрудники.ПометкаУдаления
		|	И НЕ Сотрудники.Недействителен
		|	И &Условие";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Условие",
			?(СУсловиемПоиска, "Сотрудники.МагнитныйКод = &Штрихкод",
				"НЕ Сотрудники.МагнитныйКод = """" "));
			
		Если ФильтрПоискаПоШтрихкоду.Свойство("КассирДляВхода") Тогда
			ТекстЗапроса = ТекстЗапроса +
				"
				|И Сотрудники.Ссылка = &КассирДляВхода";
		КонецЕсли;
		
		МассивЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	Если НЕ СУсловиемПоиска ИЛИ ФильтрПоискаПоШтрихкоду.Свойство("ИнформационныеКарты") Тогда
		
		ТекстУсловияПоПокупателю = "";
		Если ФильтрПоискаПоШтрихкоду.Свойство("Покупатель") 
			И ЗначениеЗаполнено(ФильтрПоискаПоШтрихкоду.Покупатель) Тогда
			ТекстУсловияПоПокупателю = "
			| И (ВидКарты.ЭтоИменнаяКарта И ДисконтныеКарты.ВладелецКарты = &ПокупательДляПоискаКарты
			|	ИЛИ ВидКарты.ЭтоИменнаяКарта = Ложь И ДисконтныеКарты.ВладелецКарты = Значение(Справочник.Контрагенты.ПустаяСсылка))";
		КонецЕсли;
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ДисконтныеКарты.КодКартыШтрихкод КАК КодКартыШтрихкод,
		|	ДисконтныеКарты.Ссылка КАК Ссылка,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	1,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	Справочник.ДисконтныеКарты КАК ДисконтныеКарты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыДисконтныхКарт КАК ВидКарты
		|		ПО ДисконтныеКарты.Владелец = ВидКарты.Ссылка
		|ГДЕ
		|	НЕ ДисконтныеКарты.ПометкаУдаления
		|	И ВидКарты.ТипКарты В (ЗНАЧЕНИЕ(Перечисление.ТипыКарт.Штриховая), ЗНАЧЕНИЕ(Перечисление.ТипыКарт.Смешанная))
		|	И &Условие";
		
		ТекстУсловия = "ДисконтныеКарты.КодКартыШтрихкод = &Штрихкод" 
			+ ТекстУсловияПоПокупателю;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Условие",
			?(СУсловиемПоиска, ТекстУсловия,
				"НЕ ДисконтныеКарты.КодКартыШтрихкод = """" "));  
		
		МассивЗапросов.Добавить(ТекстЗапроса);
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ДисконтныеКарты.КодКартыМагнитный,
		|	ДисконтныеКарты.Ссылка,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	1,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	Справочник.ДисконтныеКарты КАК ДисконтныеКарты
		|	ВНУТРЕННЕЕ Соединение Справочник.ВидыДисконтныхКарт Как ВидКарты
		|		ПО ДисконтныеКарты.Владелец = ВидКарты.Ссылка
		|ГДЕ
		|	НЕ ДисконтныеКарты.ПометкаУдаления
		|	И ВидКарты.ТипКарты = ЗНАЧЕНИЕ(Перечисление.ТипыКарт.Магнитная)
		|	И &Условие";
		
		ТекстУсловия = "ДисконтныеКарты.КодКартыМагнитный = &Штрихкод" 
			+ ТекстУсловияПоПокупателю;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Условие",
			?(СУсловиемПоиска, ТекстУсловия,
				"НЕ ДисконтныеКарты.КодКартыМагнитный = """" "));
			
		МассивЗапросов.Добавить(ТекстЗапроса);
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ДисконтныеКарты.КодКартыМагнитный,
		|	ДисконтныеКарты.Ссылка,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	1,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	Справочник.ДисконтныеКарты КАК ДисконтныеКарты
		|	ВНУТРЕННЕЕ Соединение Справочник.ВидыДисконтныхКарт Как ВидКарты
		|		ПО ДисконтныеКарты.Владелец = ВидКарты.Ссылка
		|ГДЕ
		|	НЕ ДисконтныеКарты.ПометкаУдаления
		|	И ВидКарты.ТипКарты = ЗНАЧЕНИЕ(Перечисление.ТипыКарт.Смешанная)
		|	И НЕ ДисконтныеКарты.КодКартыШтрихкод = ДисконтныеКарты.КодКартыМагнитный
		|	И &Условие";
		
		ТекстУсловия = "ДисконтныеКарты.КодКартыМагнитный = &Штрихкод" 
			+ ТекстУсловияПоПокупателю;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Условие",
			?(СУсловиемПоиска, ТекстУсловия,
				"НЕ ДисконтныеКарты.КодКартыМагнитный = """" "));
		
		МассивЗапросов.Добавить(ТекстЗапроса);
	КонецЕсли;
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьПризнакВводаНеизвестнойКИ.
Процедура ЗаполнитьПризнакВводаНеизвестнойКИ(Форма, ДобавлятьНеизвестнуюКИ) Экспорт
	
	Если Форма.ИмяФормы = "ОбщаяФорма.АнализШтрихкодов" Тогда
		ДобавлятьНеизвестнуюКИ = Истина;
	КонецЕсли;
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьМассивСправочниковСКИ.
Процедура ЗаполнитьМассивСправочниковСКИ(СправочникиСКИ, ФильтрПоискаПоШтрихкоду) Экспорт
	
	СУсловиемПоиска = ФильтрПоискаПоШтрихкоду.Количество() > 0;
	
	СправочникиСКИ.Добавить("Пользователи");
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьТаблицуШаблоновРегистрацииНовыхКарт.
Процедура ЗаполнитьТаблицуШаблоновРегистрацииНовыхКарт(Шаблоны) Экспорт
	
	Возврат;
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ДополнитьСтрокуТаблицыВыбора.
Процедура ДополнитьСтрокуТаблицыВыбора(НоваяСтрока, СтрокаВыбора) Экспорт
	
	ДополнительныеДанные = СтрокаВыбора.ДополнительныеДанные;
	
	Если ТипЗнч(СтрокаВыбора.Владелец) = Тип("СправочникСсылка.СерииНоменклатуры") Тогда
		НоваяСтрока.ПредставлениеОбъекта =
			"" + СтрокаВыбора.Владелец
			+ ", " + СтрокаВыбора.Владелец.Владелец;
	ИначеЕсли ТипЗнч(СтрокаВыбора.Владелец) = Тип("СправочникСсылка.ПартииНоменклатуры") Тогда
			НоваяСтрока.ПредставлениеОбъекта =
			"" + СтрокаВыбора.Владелец
			+ ", " + СтрокаВыбора.Владелец.Владелец;
	ИначеЕсли ТипЗнч(СтрокаВыбора.Владелец) = Тип("СправочникСсылка.ДисконтныеКарты") Тогда
		КартаНедействительна = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаВыбора.Владелец, "КартаНедействительна");
		НоваяСтрока.КартаНедействительна = КартаНедействительна;
	ИначеЕсли ДополнительныеДанные.Свойство("Карта") Тогда
		НоваяСтрока.ПредставлениеОбъекта = СтрокаВыбора.Владелец;
		Если ДополнительныеДанные.Свойство("КартаНедействительна") Тогда
			НоваяСтрока.КартаНедействительна = ДополнительныеДанные.КартаНедействительна;
		КонецЕсли;
	ИначеЕсли ТипЗнч(СтрокаВыбора.Владелец) = Тип("СправочникСсылка.Номенклатура") Тогда
		НоваяСтрока.ПредставлениеОбъекта =
			"" + СтрокаВыбора.Владелец
			+ ?(ЗначениеЗаполнено(СтрокаВыбора.Характеристика), ", " + СтрокаВыбора.Характеристика , "")
			+ ?(ЗначениеЗаполнено(СтрокаВыбора.Упаковка), ", " + СтрокаВыбора.Упаковка, "")
			+ ?(ЗначениеЗаполнено(СтрокаВыбора.СерияНоменклатуры), ", " + СтрокаВыбора.СерияНоменклатуры, "")
			+ ?(ЗначениеЗаполнено(ДополнительныеДанные.Партия), ", " + ДополнительныеДанные.Партия, "");
	ИначеЕсли ТипЗнч(СтрокаВыбора.Владелец) = Тип("СправочникСсылка.ШтрихкодыУпаковокТоваров") Тогда
		НоваяСтрока.ПредставлениеОбъекта =
			"" + СтрокаВыбора.Номенклатура
			+ ?(ЗначениеЗаполнено(СтрокаВыбора.Характеристика), ", " + СтрокаВыбора.Характеристика , "")
			+ ?(ЗначениеЗаполнено(СтрокаВыбора.Упаковка), ", " + СтрокаВыбора.Упаковка, "")
			+ ?(ЗначениеЗаполнено(СтрокаВыбора.СерияНоменклатуры), ", " + СтрокаВыбора.СерияНоменклатуры, "")
			+ ?(ЗначениеЗаполнено(ДополнительныеДанные.Партия), ", " + ДополнительныеДанные.Партия, "");
	КонецЕсли;
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьКодИКоличествоВесовогоТовара.
Процедура ЗаполнитьКодИКоличествоВесовогоТовара(Штрихкод, СтруктураВесовогоТовара) Экспорт
	
	ПрефиксыВесовыхШтрихкодов = РегистрыСведений.ШтрихкодыНоменклатуры.ПрефиксыВесовыхШтрихкодов();
	ПрефиксыШтучныхШтрихкодов = РегистрыСведений.ШтрихкодыНоменклатуры.ПрефиксыШтучныхШтрихкодов();
	
	Если СтрДлина(Штрихкод) = 13 // EAN13
		И Лев(Штрихкод, 1) = "2" Тогда // Внутренний штрихкод
		
		// Штрихкод является весовым/фасованным, выполняем преобразование.
		// Формат штрихкода: 2 + П + ЧЧЧЧЧ + BBBBB + K
		// Где,
		//  П     - Префикс весового/фасованного товара
		//  ЧЧЧЧЧ - код товара
		//  BBBBB - Вес/Количество
		//  К     - Контрольное число
		
		Если ПрефиксыВесовыхШтрихкодов.Найти(Сред(Штрихкод, 2, 1)) <> Неопределено Тогда // Найден префикс весового товара
			Знаменатель = 1000;
		ИначеЕсли ПрефиксыШтучныхШтрихкодов.Найти(Сред(Штрихкод, 2, 1)) <> Неопределено Тогда // Найден префикс фасованного товара
			Знаменатель = 1;
		Иначе
			Возврат;
		КонецЕсли;
		
		КоличествоВес = Число(Сред(Штрихкод, 8, 5)) / Знаменатель;
		
		СтруктураВесовогоТовара = Новый Структура;
		СтруктураВесовогоТовара.Вставить("КодТовара", Число(Сред(Штрихкод, 3, 5)));
		СтруктураВесовогоТовара.Вставить("КоличествоТовара", КоличествоВес);
		
	КонецЕсли;
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьДополнительныеДанныеОбъектовВыборки.
Процедура ЗаполнитьДополнительныеДанныеОбъектовВыборки(СтруктураШтрихкода, Выборка) Экспорт 
	
	ТипВладельца = ТипЗнч(Выборка.Владелец);
	
	СтруктураШтрихкода.Вставить("Партия", Выборка.Партия);
	
	Если ТипВладельца = Тип("СправочникСсылка.ШтрихкодыУпаковокТоваров") Тогда
		СтруктураШтрихкода.Вставить("Номенклатура", Выборка.Владелец.Номенклатура);
		СтруктураШтрихкода.Вставить("Характеристика", Выборка.Характеристика);
		СтруктураШтрихкода.Вставить("Упаковка", Выборка.Упаковка);
		СтруктураШтрихкода.Вставить("СерияНоменклатуры", Выборка.СерияНоменклатуры);
		СтруктураШтрихкода.Вставить("СрокГодности");
		СтруктураШтрихкода.Вставить("ВесИзШтрихкода", Истина);
	ИначеЕсли ТипВладельца = Тип("СправочникСсылка.Номенклатура") Тогда
		СтруктураШтрихкода.Вставить("Номенклатура", Выборка.Владелец);
		СтруктураШтрихкода.Вставить("СерияНоменклатуры", Выборка.СерияНоменклатуры);
		СтруктураШтрихкода.Вставить("СрокГодности");
		Если Выборка.ШаблонШтрихкода = Перечисления.ШаблоныШтрихкодов.НоменклатураВесовой Тогда
			СтруктураШтрихкода.Вставить("ВесИзШтрихкода", Истина);
		КонецЕсли;
		// +ор
		Если Выборка.ПоказыватьЦеныПоХарактеристикам Тогда
			СтруктураШтрихкода.Вставить("ОтображатьЦены", Выборка.ПоказыватьЦеныПоХарактеристикам);
		КонецЕсли;
		// -ор
	ИначеЕсли ТипВладельца = Тип("СправочникСсылка.ДисконтныеКарты") Тогда
		ВладелецКарты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Владелец, "ВладелецКарты");
		СтруктураШтрихкода.Вставить("ВладелецКарты", ВладелецКарты);
		ДанныеДисконтнойКарты = ДисконтныеКартыУНФСервер.ПолучитьДанныеКарты(Выборка.Владелец);
		СтруктураШтрихкода.Вставить("Остаток", ДанныеДисконтнойКарты.ОстатокБаллов);
		СтруктураШтрихкода.Вставить("ПродажиОборот", ДанныеДисконтнойКарты.ПродажиОборот);
	ИначеЕсли ТипВладельца = Тип("Неопределено") Тогда
		Если Выборка.ШаблонШтрихкода = Перечисления.ШаблоныШтрихкодов.Телефон Тогда
			СтруктураШтрихкода.Вставить("НомерТелефона", Выборка.Штрихкод);
		КонецЕсли;
	КонецЕсли;
	
	Если СтруктураШтрихкода.Свойство("СрокГодности") Тогда
		ОбщегоНазначенияРМКУНФ.ЗаполнитьСрокГодностиСерии(Выборка.СерияНоменклатуры, СтруктураШтрихкода.СрокГодности);
	КонецЕсли;
	
	Если СтруктураШтрихкода.Свойство("Номенклатура") Тогда
		СтруктураШтрихкода.Вставить("ОтображатьОстатки", Истина);
	КонецЕсли;
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьОстаткиПоСкладу.
Процедура ЗаполнитьОстаткиПоСкладу(ТаблицаНоменклатурыДляОстатков,
	СкладОстатков, ТаблицаОстатков) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ТаблицаНоменклатуры.Характеристика КАК Характеристика,
	|	ТаблицаНоменклатуры.Упаковка КАК Упаковка
	|ПОМЕСТИТЬ ТаблицаНоменклатуры
	|ИЗ
	|	&ИсходныеДанные КАК ТаблицаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтруктурныеЕдиницы.Ссылка КАК Склад,
	|	СтруктурныеЕдиницы.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы
	|ПОМЕСТИТЬ ДанныеТорговогоОбъекта
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|ГДЕ
	|	СтруктурныеЕдиницы.Ссылка = &Магазин
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтруктурныеЕдиницы.Ссылка КАК Склад
	|ПОМЕСТИТЬ ТаблицаСклады
	|ИЗ
	|	ДанныеТорговогоОбъекта КАК ДанныеТорговогоОбъекта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|		ПО ДанныеТорговогоОбъекта.Склад = СтруктурныеЕдиницы.Родитель
	|ГДЕ
	|	ДанныеТорговогоОбъекта.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.МагазинГруппаСкладов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтруктурныеЕдиницы.Ссылка
	|ИЗ
	|	ДанныеТорговогоОбъекта КАК ДанныеТорговогоОбъекта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|		ПО ДанныеТорговогоОбъекта.Склад = СтруктурныеЕдиницы.Ссылка
	|ГДЕ
	|	(ДанныеТорговогоОбъекта.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|			ИЛИ ДанныеТорговогоОбъекта.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Остатки.Номенклатура КАК Номенклатура,
	|	Остатки.Характеристика КАК Характеристика,
	|	СУММА(Остатки.Количество) КАК Остаток,
	|	СУММА(Остатки.Резерв) КАК Резерв
	|ПОМЕСТИТЬ ОстаткиНоменклатуры
	|ИЗ
	|	РегистрСведений.ОстаткиТоваров КАК Остатки
	|ГДЕ
	|	Остатки.СтруктурнаяЕдиница В
	|			(ВЫБРАТЬ
	|				ТаблицаСклады.Склад КАК Склад
	|			ИЗ
	|				ТаблицаСклады КАК ТаблицаСклады)
	|	И (Остатки.Номенклатура, Остатки.Характеристика) В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
	|				ТаблицаНоменклатуры.Характеристика КАК Характеристика
	|			ИЗ
	|				ТаблицаНоменклатуры КАК ТаблицаНоменклатуры)
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.Номенклатура,
	|	Остатки.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ТаблицаНоменклатуры.Характеристика КАК Характеристика,
	|	ТаблицаНоменклатуры.Упаковка КАК Упаковка,
	|	Остатки.Остаток / ВЫБОР
	|		КОГДА ТаблицаНоменклатуры.Упаковка ССЫЛКА Справочник.ЕдиницыИзмерения
	|			ТОГДА ЕСТЬNULL(ЕдиницыИзмерения.Коэффициент, 1)
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Остаток,
	|	Остатки.Резерв / ВЫБОР
	|		КОГДА ТаблицаНоменклатуры.Упаковка ССЫЛКА Справочник.ЕдиницыИзмерения
	|			ТОГДА ЕСТЬNULL(ЕдиницыИзмерения.Коэффициент, 1)
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Резерв
	|ИЗ
	|	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО ТаблицаНоменклатуры.Упаковка = ЕдиницыИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиНоменклатуры КАК Остатки
	|		ПО ТаблицаНоменклатуры.Номенклатура = Остатки.Номенклатура
	|			И ТаблицаНоменклатуры.Характеристика = Остатки.Характеристика");
	
	Запрос.УстановитьПараметр("ИсходныеДанные", ТаблицаНоменклатурыДляОстатков);
	Запрос.УстановитьПараметр("Магазин", СкладОстатков);
	
	ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьТекущийСклад.
Процедура ЗаполнитьТекущийСклад(ТекущийСклад) Экспорт
	
	ТекущийСклад = Справочники.СтруктурныеЕдиницы.ОсновнойСклад();
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.СкорректироватьСтруктуруРезультата.
Процедура СкорректироватьСтруктуруРезультата(
			СтруктураПараметров,
			Штрихкод,
			СтруктураДействий,
			НеизвестныеДанныеПО,
			ВозможнаРегистрацияНовойНоменклатуры) Экспорт
			
	ШтрихкодМарки = Неопределено;
	Если СтруктураПараметров.Свойство("ПараметрыШтрихкода")
		И Не СтруктураПараметров.ПараметрыШтрихкода = Неопределено
		И СтруктураПараметров.ПараметрыШтрихкода.Свойство("ФильтрПоискаПоШтрихкоду")
		И (СтруктураПараметров.ПараметрыШтрихкода.ФильтрПоискаПоШтрихкоду.Свойство("ПриоритетШтрихкодаУпаковок")
		Или СтруктураПараметров.ПараметрыШтрихкода.ФильтрПоискаПоШтрихкоду.Свойство("ИнформационныеКарты")) Тогда
			ШтрихкодМарки = СтруктураПараметров.ПараметрыШтрихкода.ШтрихкодМарки;
	Иначе
		Возврат;
	КонецЕсли;
	
	ЗначенияПоиска = СтруктураПараметров.ЗначенияПоиска;
	
	ИндексМассива = 0;
	ИндексШтрихкодаУпаковок = Новый Массив;
	ШтрихкодУпаковокДляДобавления = Неопределено;
	СоотвествиеКартЛояльности = Новый Соответствие;
	КоличествоЗначенийПоиска = 0;
	Для Каждого ЗначениеПоиска Из ЗначенияПоиска Цикл
		Если ЗначениеПоиска.ТипОбъекта = Тип("СправочникСсылка.ШтрихкодыУпаковокТоваров") Тогда
			ЗначениеШтрихкода = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗначениеПоиска.Владелец, "ЗначениеШтрихкода");
			Если ШтрихкодУпаковокДляДобавления = Неопределено Тогда
				ШтрихкодУпаковокДляДобавления = ЗначениеПоиска.Владелец;
			КонецЕсли;
			Если ЗначениеШтрихкода = ШтрихкодМарки Тогда
				ШтрихкодУпаковокДляДобавления = ЗначениеПоиска.Владелец;
			КонецЕсли;
		ИначеЕсли ЗначениеПоиска.ТипОбъекта = Тип("СправочникСсылка.ДисконтныеКарты") Тогда
			КоличествоЗначенийПоиска = КоличествоЗначенийПоиска + 1;
			СоотвествиеКартЛояльности.Вставить(ЗначениеПоиска.Владелец, ЗначениеПоиска)
		КонецЕсли;
	КонецЦикла;
	
	Если КоличествоЗначенийПоиска = ЗначенияПоиска.Количество() Тогда
		ЗначенияПоиска.Очистить();
		Для Каждого СтрокаЗаписи Из СоотвествиеКартЛояльности Цикл
			ЗначенияПоиска.Добавить(СтрокаЗаписи.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Если Не ШтрихкодУпаковокДляДобавления = Неопределено Тогда
		Для Каждого ЗначениеПоиска Из ЗначенияПоиска Цикл
			Если ЗначениеПоиска.ТипОбъекта = Тип("СправочникСсылка.ШтрихкодыУпаковокТоваров") Тогда	
				Если ШтрихкодУпаковокДляДобавления = ЗначениеПоиска.Владелец Тогда
					ИндексШтрихкодаУпаковок.Добавить(ИндексМассива);
				КонецЕсли;
			КонецЕсли;
			ИндексМассива = ИндексМассива + 1;
		КонецЦикла;
	КонецЕсли;
	
	Если Не ИндексШтрихкодаУпаковок.Количество() = 0 Тогда
		ИндексМассива = 0;
		НовыеЗначенияПоиска = Новый Массив;
		Для Каждого ЗначениеПоиска Из ЗначенияПоиска Цикл
			Если (ЗначениеПоиска.ТипОбъекта = Тип("СправочникСсылка.Номенклатура")
				Или ЗначениеПоиска.ТипОбъекта = Тип("СправочникСсылка.ШтрихкодыУпаковокТоваров"))
				И ИндексШтрихкодаУпаковок.Найти(ИндексМассива) = Неопределено Тогда
				ИндексМассива = ИндексМассива + 1;
				Продолжить;
			КонецЕсли;
			
			НовыеЗначенияПоиска.Добавить(ЗначениеПоиска);
			ИндексМассива = ИндексМассива + 1;
		КонецЦикла;
		
		СтруктураПараметров.ЗначенияПоиска = НовыеЗначенияПоиска;
	КонецЕсли;
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ДополнитьПараметрыЗапросаПоиска.
Процедура ДополнитьПараметрыЗапросаПоиска(Запрос, Форма, ДополнительныеПараметры) Экспорт
	
	Если Запрос.Параметры.Свойство("КодТовара") Тогда
		КоличествоТовара = Запрос.Параметры.КоличествоТовара;
		Если КоличествоТовара > 0 Тогда
			КодТовара = Запрос.Параметры.КодТовара;
			ПрефиксШК = Сред(Запрос.Параметры.Штрихкод, 2, 1);
			ШтрихкодТовара = РегистрыСведений.ШтрихкодыНоменклатуры.ПолучитьШтрихкодВесовогоТовараПоКоду(КодТовара, ПрефиксШК);
		Иначе
			ШтрихкодТовара = "";
		КонецЕсли;
		Запрос.УстановитьПараметр("ШтрихкодСНулевымВесом", ШтрихкодТовара);
	КонецЕсли;
	
	Если Форма.ИмяФормы = "ОбщаяФорма.АнализШтрихкодов"
		// ор ++
		ИЛИ Форма.ИмяФормы = "Обработка.ор_УправлениеРасположениемНоменклатуры.Форма.Форма" Тогда
		// ор --
		Возврат;
	КонецЕсли;
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ФильтрПоискаПоШтрихкоду") Тогда
		Возврат
	КонецЕсли;
	
	ФильтрПоискаПоШтрихкоду = Форма.ФильтрПоискаПоШтрихкоду;
	Если НЕ ФильтрПоискаПоШтрихкоду = Неопределено Тогда
		НоменклатураДляПоискаСерии = Неопределено;
		ФильтрПоискаПоШтрихкоду.Свойство("СерииНоменклатуры", НоменклатураДляПоискаСерии);
		Запрос.УстановитьПараметр("НоменклатураДляПоискаСерии", НоменклатураДляПоискаСерии);
		
		МассивУжеДобавленныхСерий = Неопределено;
		ФильтрПоискаПоШтрихкоду.Свойство("МассивУжеДобавленныхСерий", МассивУжеДобавленныхСерий);
		Запрос.УстановитьПараметр("МассивУжеДобавленныхСерий", МассивУжеДобавленныхСерий);
		
		КассирДляВхода = Неопределено;
		ФильтрПоискаПоШтрихкоду.Свойство("КассирДляВхода", КассирДляВхода);
		Запрос.УстановитьПараметр("КассирДляВхода", КассирДляВхода);
		
		ЗаданнаяТаблицаНоменклатуры = Неопределено;
		ФильтрПоискаПоШтрихкоду.Свойство("ЗаданнаяТаблицаНоменклатуры", ЗаданнаяТаблицаНоменклатуры);
		Запрос.УстановитьПараметр("ЗаданнаяТаблицаНоменклатуры", ЗаданнаяТаблицаНоменклатуры);
		
		Покупатель = Неопределено;
		ФильтрПоискаПоШтрихкоду.Свойство("Покупатель", Покупатель);
		Запрос.УстановитьПараметр("ПокупательДляПоискаКарты", Покупатель);		
	КонецЕсли;
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьФильтрПоискаПоУмолчанию.
Процедура ЗаполнитьФильтрПоискаПоУмолчанию(ФильтрПоискаПоУмолчанию) Экспорт
	
	ФильтрПоискаПоШтрихкоду = Новый Структура;
	ФильтрПоискаПоШтрихкоду.Вставить("Номенклатура");
	
	ФильтрПоискаПоШтрихкоду.Вставить("ФизическиеЛица");
	ФильтрПоискаПоШтрихкоду.Вставить("ИнформационныеКарты");
	
	ФильтрПоискаПоУмолчанию = ФильтрПоискаПоШтрихкоду;
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ОпределитьФильтрПоискаШтрихкода.
Процедура ОпределитьФильтрПоискаШтрихкода(Форма) Экспорт
	
	Возврат;
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.НастроитьФормуАнализаШтрихкодов.
Процедура НастроитьФормуАнализаШтрихкодов(Форма) Экспорт
	
	Форма.Элементы.ТаблицаОшибокУпаковка.Заголовок = НСтр("ru='Единица измерения'");
	Форма.Элементы.ТаблицаШаблоновДополнительноеОписание.Видимость = Ложь;
	Форма.Элементы.ТаблицаОшибокПартия.Видимость = Истина;
	
КонецПроцедуры

// См. РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьДанныеПоискаПоШтрихкоду.
Процедура ЗаполнитьДанныеПоискаПоШтрихкоду(Штрихкод, Форма, ДанныеШтрихкода) Экспорт
	
	ДанныеШтрихкода = РаботаСоШтрихкодами.ДанныеПоискаПоШтрихкоду(Штрихкод, Форма);
	
КонецПроцедуры

// Настраивает подключаемое оборудование в форме,
// устанавливает флаг ИспользоватьПодключаемоеОборудование в форме.
//
// Параметры:
//  Форма - УправляемаяФорма - форма в которой настраивается подключение оборудования.
//
Процедура НастроитьПодключаемоеОборудование(Форма) Экспорт
	
	МенеджерОборудованияРМК.НастроитьПодключаемоеОборудование(Форма);
	
КонецПроцедуры

Функция ОбработатьРезультатРазбораКодаМаркировки(ДанныеРазбораКода, ПримечаниеКРазборуШтрихкода) Экспорт
	
	РезультатРазбора = ДанныеРазбораКода;
	
	ИдентификаторыОшибокРазбораКодаМаркировки = РазборКодаМаркировкиИССлужебныйКлиентСервер.ИдентификаторыОшибокРазбораКодаМаркировки();
	
	Если ПримечаниеКРазборуШтрихкода <> Неопределено 
		И ПримечаниеКРазборуШтрихкода.ИдентификаторОшибки = ИдентификаторыОшибокРазбораКодаМаркировки.КодМаркировкиСоответствуетНесколькимШаблонам
		Тогда
		
		ВариантДанныхРазбора  = Неопределено;
		ВариантыДанныхРазбора = Неопределено;
		
		Для Каждого ДанныеРазбора Из ПримечаниеКРазборуШтрихкода.РезультатРазбора Цикл
			
			Если ВариантДанныхРазбора = Неопределено
				И ВариантыДанныхРазбора = Неопределено Тогда
				ВариантДанныхРазбора = ДанныеРазбора;
				Продолжить;
			ИначеЕсли ВариантыДанныхРазбора = Неопределено Тогда
				
				ВариантыДанныхРазбора = Новый ТаблицаЗначений;
				ВариантыДанныхРазбора.Колонки.Добавить("ДанныеРазбора");
				ВариантыДанныхРазбора.Колонки.Добавить("Приоритет");
				
				ВариантДанныхРазбора = Неопределено;
				
			КонецЕсли;
			
			НовыйВариант = ВариантыДанныхРазбора.Добавить();
			НовыйВариант.ДанныеРазбора = ДанныеРазбора;
			
			Если ДанныеРазбора.Свойство("СоставКодаМаркировки")
				И ДанныеРазбора.СоставКодаМаркировки.Свойство("ВключаетКриптоХвост") Тогда
				
				ВключаетКриптоХвост = ДанныеРазбора.СоставКодаМаркировки.ВключаетКриптоХвост;
				Если Не ТипЗнч(ВключаетКриптоХвост) = Тип("Булево") Тогда
					ВключаетКриптоХвост = Ложь;
				КонецЕсли;
				Если ВключаетКриптоХвост Тогда
					НовыйВариант.Приоритет = 1;
				КонецЕсли;
				
			Иначе
				НовыйВариант.Приоритет = 0;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ВариантыДанныхРазбора <> Неопределено
			И ВариантыДанныхРазбора.Количество() Тогда
			ВариантыДанныхРазбора.Сортировать("Приоритет Убыв");
			ВариантДанныхРазбора = ВариантыДанныхРазбора[0].ДанныеРазбора;
		КонецЕсли;
		
		РезультатРазбора = ВариантДанныхРазбора;
		
	КонецЕсли;
	
	Возврат РезультатРазбора;
	
КонецФункции
#КонецОбласти
